Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: ListView, TreeView and StatusBar: Same as for the Click event.
ja: ListView、TreeView、StatusBar：Clickイベントと同じです。

source: ListView, TreeView, Gui(), Gui object, GuiControl object, Menu object
ja: ListView、TreeView、Gui()、Guiオブジェクト、GuiControlオブジェクト、Menuオブジェクト

source: ListView: The row number of the clicked item, or 0 if the mouse was not over an item.
ja: ListView：クリックされた項目の行番号、またはマウスが項目上にない場合は0を指定します。

source: ListViewGetContent replaces "ControlGet List" for ListView, and currently has the same usage as before.
ja: ListViewGetContentは、ListViewの「ControlGet List」に代わるもので、現在は従来と同じ使い方ができます。

source: ListViewGetContent, WinGetList, Control functions
ja: ListViewGetContent、WinGetList、Control関数

source: Ln: Returns the natural logarithm (base e) of a number.
ja: Ln：自然対数（底e）：数値の自然対数を返します。

source: Loads a DLL or EXE file before the script starts executing.
ja: スクリプトの実行を開始する前に、DLLまたはEXEファイルをロードします。

source: Local variables, including variables of outer functions which are referenced by the current function.
ja: ローカル変数（現在の関数が参照する外部関数の変数を含みます）。

source: Log: Returns the logarithm (base 10) of a number.
ja: Log：Logarithm関数は、数値の対数（10進数）を返します。

source: Loop Count executes a statement repeatedly:
ja: Loop Count あるステートメントを繰り返し実行することです。

source: Loop Files retrieves the specified files or folders, one at a time.
ja: Loop Filesは、指定したファイルやフォルダを1つずつ取得します。

source: Loop Parse retrieves substrings (fields) from a string, one at a time.
ja: Loop Parseは、文字列から部分文字列（フィールド）を1つずつ取り出します。

source: Loop Read and File.ReadLine no longer interpret the character Ctrl+Z (0x1A) as an end-of-file marker.
ja: Loop Readと File.ReadLineで、文字Ctrl+Z（0x1A）をファイル終了マーカーとして解釈しないようになりました。

source: Loop Read retrieves the lines in a text file, one at a time.
ja: Loop Readは、テキストファイルの行を1行ずつ取得します。

source: Loop Read: As above, but the presence of Else also prevents an error from being thrown if the file or path is not found.
ja: Loop Read：上記と同様ですが、Elseの存在により、ファイルやパスが見つからない場合にエラーが発生するのを防ぐこともできます。

source: Loop Reg retrieves the contents of the specified registry subkey, one item at a time.
ja: Loop Regは、指定されたレジストリのサブキーの内容を1項目ずつ取得します。

source: Loop (except Loop Count) is now followed by a secondary keyword (Files, Parse, Read or Reg) which cannot be "quoted" or contained by a variable.
ja: Loop（Loop Countを除く）の後に、「引用」したり変数で囲むことのできない副キーワード（Files、Parse、ReadまたはReg）が続くようになりました。

source: Loop, Break, Continue, Blocks, RegRead, RegWrite, RegDelete, RegDeleteKey, SetRegView
ja: Loop、Break、Continue、ブロック、RegRead、RegWrite、RegDelete、RegDeleteKey、SetRegView

source: Loop, Break, Continue, Blocks, SplitPath, FileSetAttrib, FileSetTime
ja: Loop、Break、Continue、ブロック、SplitPath、FileSetAttrib、FileSetTime

source: Loop, While-loop, For-loop, Break, Continue, Blocks, Files-and-folders loop, Registry loop, File-reading loop, Parsing loop, If
ja: Loop、Whileループ、Forループ、Break、Continue、ブロック、ファイルループ、レジストリループ、ファイル読み込みループ、解析ループ、If

source: Loops, blocks, IFs, ELSEs and other control flow statements are given the memory addresses of their related jump-points in the script.
ja: Loops、ブロック、IFs、ELSEs、その他の制御フロー文には、スクリプト内で関連するジャンプポイントのメモリーアドレスが与えられます。

source: Lots and lots of them.
ja: たくさん、たくさんだ。

source: MarginX: Retrieves or sets the size of horizontal margins between sides and subsequently created controls.
ja: MarginX：側面とその後に作成されるコントロールの間の水平マージンのサイズを取得または設定します。

source: MarginY: Retrieves or sets the size of vertical margins between sides and subsequently created controls.
ja: MarginY：側面とその後に作成されるコントロールの間の垂直マージンのサイズを取得または設定します。

source: Match: Returns the MatchList item which caused the Input to terminate.
ja: Match：Inputを終了させたMatchListの項目を返します。

source: Math functions throw an exception if any of their inputs are non-numeric, or if the operation is invalid (such as division by zero).
ja: 数学関数は、入力が非数値の場合、または演算が無効な場合（ゼロ除算など）、例外を発生させます。

source: MaxParams: Returns the number of formally-declared parameters for a user-defined function or maximum parameters for a built-in function.
ja: MaxParams：ユーザー定義関数の場合は正式に宣言されたパラメータの数、組み込み関数の場合は最大パラメータ数を返します。

source: Maximize: Unhides and maximizes the window.
ja: Maximize：ウィンドウの非表示と最大化を解除します。

source: Menu masking is disabled.
ja: Menu maskingは無効です。

source: Menu(), MenuFromHandle and A_TrayMenu return an object of this type.
ja: Menu()、MenuFromHandleおよびA_TrayMenuは、この型のオブジェクトを返す。

source: Menu.Handle returns a handle to a Win32 menu (a handle of type HMENU), constructing it if necessary.
ja: Menu.Handleは、Win32メニューのハンドル（HMENU型ハンドル）を、必要に応じて構築して返します。

source: MenuBar: Retrieves or sets the window's menu bar.
ja: MenuBar：ウィンドウのメニューバーを取得または設定します。

source: Meta-functions can be used to further control how an object behaves.
ja: メタファンクションは、オブジェクトの振る舞いをさらにコントロールするために使うことができる。

source: Methods:
ja: メソッド：

source: MinParams: Returns the number of required parameters.
ja: MinParams：必要なパラメータの数を返します。

source: MinSendLevel: Retrieves or sets the minimum send level of input to collect.
ja: MinSendLevel：収集する入力の最小送信レベルを取得または設定します。

source: Minimize: Unhides and minimizes the window.
ja: Minimize：ウィンドウの非表示と最小化を行います。

source: Misc: Check miscellaneous conditions based on a given value or variable reference.
ja: Misc：与えられた値や変数の参照に基づき、様々な条件をチェックします。

source: Mod: Modulo.
ja: Mod：モジュロ。

source: Modify: Modifies the attributes and/or name of an item.
ja: Modify：アイテムの属性や名前を変更する。

source: Modify: Modifies the attributes and/or text of a row.
ja: Modify：行の属性やテキストを変更する。

source: ModifyCol: Modifies the attributes and/or text of the specified column and its header.
ja: ModifyCol：指定されたカラムとそのヘッダーの属性とテキストを変更します。

source: MonitorGet, SysGet, Monitor functions
ja: MonitorGet、SysGet、Monitor関数

source: MonitorGetWorkArea, SysGet, Monitor functions
ja: MonitorGetWorkArea、SysGet、Monitor関数

source: Mouse wheel hotkeys (WheelDown/Up/Left/Right)
ja: マウスホイールホットキー（WheelDown/Up/Left/Right）

source: MouseClick and MouseClickDrag are no longer affected by the system setting for swapped mouse buttons; "Left" is the always the primary button and "Right" is the secondary.
ja: MouseClickと MouseClickDragは、マウスボタンの入れ替えに関するシステム設定の影響を受けなくなりました。「Left」は常にプライマリボタン、「Right」はセカンダリボタンです。

source: Move: Moves and/or resizes the control.
ja: Move：コントロールの移動およびサイズ変更を行います。

source: Move: Moves and/or resizes the window.
ja: Move：ウィンドウを移動またはサイズ変更します。

source: MsgBox has had its syntax changed to prioritise its most commonly used parameters and improve ease of use.
ja: MsgBoxは、最もよく使われるパラメータを優先し、使いやすさを向上させるために構文が変更されました。

source: MsgBox now returns the button name.
ja: MsgBoxがボタン名を返すようになりました。

source: Name substitution allows a property name to be determined by evaluating an expression or variable.
ja: 名前の置換は、式または変数を評価することによってプロパティ名を決定することができます。

source: Name: Retrieves or sets a custom name for the window.
ja: Name：ウィンドウのカスタムネームを取得または設定します。

source: Name: Retrieves or sets the explicit name of the control.
ja: Name：コントロールの明示的な名前を取得または設定します。

source: Name: Returns the function's name.
ja: Name：関数の名前を返します。

source: Nested functions may refer to local and static variables created by an enclosing function.
ja: ネストされた関数は、包含する関数が作成したローカル変数や静的変数を参照することができます。

source: NoTimers: Prevents interruptions from any timers.
ja: NoTimers：あらゆるタイマーからの割り込みを防ぐ。

source: Nop: Does nothing.
ja: Nop：何もしない。

source: NotifyNonText: Controls whether the OnKeyDown and OnKeyUp callbacks are called whenever a non-text key is pressed.
ja: NotifyNonText：テキスト以外のキーが押されたときに、OnKeyDownおよびOnKeyUpコールバックを呼び出すかどうかを制御します。

source: NumGet, DllCall, Buffer object, VarSetStrCapacity
ja: NumGet、DllCall、Bufferオブジェクト、VarSetStrCapacity

source: NumPut, DllCall, Buffer object, VarSetStrCapacity
ja: NumPut、DllCall、Bufferオブジェクト、VarSetStrCapacity

source: NumPut/NumGet: When a variable is passed directly, the address of the variable's internal string buffer is no longer used.
ja: NumPut/NumGet：変数を直接渡す場合、その変数の内部文字列バッファのアドレスは使用されなくなります。

source: Number or String
ja: 数字または文字列

source: Numbers (integers and floating-point numbers)
ja: 数字（整数、浮動小数点数）

source: OSError (very rare):
ja: OSError (非常にまれ)：

source: OSError (very rare): the X or Y position is omitted and the control's position could not be determined.
ja: OSError（非常にまれ）：の場合、X または Y の位置が省略され、コントロールの位置を決定することができなかった。

source: OSError: The HRESULT return type was used and the function returned an error value (as defined by the FAILED macro).
ja: OSError：HRESULT戻り値が使用され、関数がエラー値（FAILED マクロで定義）を返しました。

source: Obey: Obeys a command or expression.
ja: Obey：命令や表現に従う。

source: ObjBindMethod can be used to bind to a method even when it isn't possible to retrieve a reference to the method itself.
ja: ObjBindMethodは、メソッド自体への参照を取得できない場合でも、メソッドにバインドするために使用できます。

source: ObjGetBase and the Base property return one of the predefined prototype objects when appropriate.
ja: ObjGetBaseと Baseプロパティは、適切な場合、定義済みのプロトタイプ・オブジェクトの1つを返します。

source: ObjGetBase: Returns the value's base object.
ja: ObjGetBase：値のベースとなるオブジェクトを返します。

source: ObjGetCapacity and ObjSetCapacity now only affect the object's capacity to contain properties, and are not expected to be commonly used.
ja: ObjGetCapacityと ObjSetCapacityは、プロパティを含むオブジェクトの容量にのみ影響するようになり、一般的に使用されることはないと予想されます。

source: ObjGetCapacity, ObjSetCapacity: Retrieve or set an Object's capacity to contain properties.
ja: ObjGetCapacity、ObjSetCapacity：プロパティを含む Object の容量を取得または設定する。

source: ObjHasOwnProp (formerly ObjHasKey) and ObjOwnProps (formerly ObjNewEnum) are kept to facilitate safe inspection of objects which have redefined those methods (and the primitive prototypes, which don't have them defined).
ja: ObjHasOwnProp（旧ObjHasKey）とObjOwnProps（旧ObjNewEnum）は、これらのメソッドを再定義したオブジェクト（およびそれらが定義されていないプリミティブプロトタイプ）を安全に検査するために保持されています。

source: ObjOwnPropCount: Retrieve the number of own properties contained by an object.
ja: ObjOwnPropCount：オブジェクトに含まれる自身のプロパティの数を取得する。

source: ObjSetBase: Set an object's base object.
ja: ObjSetBase：オブジェクトのベースオブジェクトを設定する。

source: Object Protocol:
ja: オブジェクトプロトコル：

source: Object Protocol: Specifics about how a script interacts with an object.
ja: オブジェクトプロトコル：スクリプトがオブジェクトとどのように相互作用するかについての詳細。

source: Object
ja: オブジェクト

source: Object or Integer
ja: オブジェクトまたは整数

source: Object, String or Integer
ja: オブジェクト、文字列、整数のいずれか

source: Objects
ja: オブジェクト

source: Objects are a way of organizing your data for more efficient usage.
ja: オブジェクトは、データをより効率的に使用するための整理方法です。

source: Objects, HasBase, HasMethod
ja: オブジェクト、HasBase、HasMethod

source: Objects, HasBase, HasProp, GetMethod
ja: オブジェクト、HasBase、HasProp、GetMethod

source: Objects, HasMethod, HasBase, HasProp
ja: オブジェクト、HasMethod、HasBase、HasProp

source: Objects, Obj.Base, ObjGetBase, HasMethod, HasProp
ja: オブジェクト、Obj.Base、ObjGetBase、HasMethod、HasProp

source: Objects:
ja: オブジェクト：

source: Objects: General explanation of objects.
ja: オブジェクト：オブジェクトの一般的な説明。

source: OnChar: Retrieves or sets the function object which is called after a character is added to the input buffer.
ja: OnChar：入力バッファに文字が追加された後に呼び出される関数オブジェクトを取得または設定します。

source: OnClipboardChange: For detecting and responding to clipboard changes.
ja: OnClipboardChange：クリップボードの変化を検知して対応するため。

source: OnCommand can be used for notifications which are sent as a WM_COMMAND message.
ja: OnCommandは、WM_COMMANDメッセージとして送信される通知に対して使用することができます。

source: OnEnd: Retrieves or sets the function object which is called when Input is terminated.
ja: OnEnd：Input終了時に呼び出される関数オブジェクトを取得または設定します。

source: OnError callbacks now take a second parameter, containing one of the following values:
ja: OnErrorコールバックは、以下の値のいずれかを含む第2パラメータを取るようになりました：

source: OnError is now called for critical errors prior to exiting the script.
ja: 重大なエラーが発生した場合、スクリプトを終了する前にOnErrorが呼び出されるようになりました。

source: OnError now requires a function object, not a name.
ja: OnErrorに名前ではなく、関数オブジェクトを要求するようになりました。

source: OnError, OnMessage, CallbackCreate, OnClipboardChange, ExitApp, Shutdown, Persistent, Threads, Return
ja: OnError、OnMessage、CallbackCreate、OnClipboardChange、ExitApp、Shutdown、Persistent、スレッド、Return

source: OnEvent: Registers a function or method to be called when the given event is raised.
ja: OnEvent：与えられたイベントが発生したときに呼び出される関数またはメソッドを登録します。

source: OnKeyDown: Retrieves or sets the function object which is called when a notification-enabled key is pressed.
ja: OnKeyDown：通知可能なキーが押されたときに呼び出される関数オブジェクトを取得または設定します。

source: OnKeyUp: Retrieves or sets the function object which is called when a notification-enabled key is released.
ja: OnKeyUp：通知可能なキーがリリースされたときに呼び出される関数オブジェクトを取得または設定します。

source: OnMessage no longer has the single-function-per-message mode that was used when a function name (string) was passed; it now only accepts a function by reference.
ja: OnMessageは、関数名（文字列）が渡されたときに使用されていた、メッセージごとの単一関数モードがなくなり、参照による関数のみを受け入れるようになりました。

source: OnNotify can be used for notifications which are sent as a WM_NOTIFY message.
ja: OnNotifyは、WM_NOTIFYメッセージとして送信される通知に対して使用することができます。

source: Opt: Sets various options and styles for the appearance and behavior of the control.
ja: Opt：コントロールの外観や動作に関するさまざまなオプションやスタイルを設定します。

source: Opt: Sets various options and styles for the appearance and behavior of the window.
ja: Opt：ウィンドウの外観や動作に関するさまざまなオプションやスタイルを設定します。

source: Option Properties:
ja: オプションプロパティ：

source: Optional parameters are specified by following the parameter name with := and a default value, which must be a literal quoted string, a number, true, false or unset.
ja: オプションのパラメータは、パラメータ名の後に:=を付けて指定し、デフォルト値を指定します。この値は、リテラルな引用符で囲まれた文字列、数値、true、false、またはunsetでなければなりません。

source: OwnProps: Enumerates an object's own properties.
ja: OwnProps：オブジェクト自身のプロパティを列挙する。

source: Parsing loop, Sort, SplitPath, InStr, SubStr, StrLen, StrLower, StrUpper, StrReplace
ja: 解析ループ、Sort、SplitPath、InStr、SubStr、StrLen、StrLower、StrUpper、StrReplace

source: Passing Command Line Parameters to a Script:
ja: スクリプトにコマンドラインパラメータを渡す：

source: Passing Command Line Parameters to a Script: The variable A_Args contains the incoming parameters.
ja: スクリプトにコマンドラインパラメータを渡す：変数A_Argsには、入力されるパラメータが格納される。

source: Pause is no longer exempt from #MaxThreadsPerHotkey when used on the first line of a hotkey, so #p::Pause is no longer suitable for toggling pause.
ja: Pauseは、ホットキーの1行目で使用すると#MaxThreadsPerHotkeyの適用除外になるため、#p::Pauseは、一時停止を切り替えるのに適さなくなりました。

source: Persistent ; Prevent the script from exiting automatically.
ja: Persistent ; スクリプトが自動的に終了するのを防ぎます。

source: PixelSearch and PixelGetColor use RGB values instead of BGR, for consistency with other functions.
ja: PixelSearchと PixelGetColorは、他の関数との整合性のために、BGRの代わりにRGB値を使用します。

source: Pop: Removes and returns the last array element.
ja: Pop：配列の最後の要素を削除して返します。

source: Pos: Retrieves or sets the position of the file pointer.
ja: Pos：ファイルポインタの位置を取得または設定します。

source: PostExec: Runs a program after compilation.
ja: PostExec：コンパイル後にプログラムを実行する。

source: PostMessage(0x0185, 1, -1, "ListBox1", WinTitle) ; Select all listbox items. 0x0185 is LB_SETSEL.
ja: PostMessage(0x0185, 1, -1, "ListBox1", WinTitle) ; リストボックスの全項目を選択します。0x0185はLB_SETSELです。

source: PostMessage, Message List, Message Tutorial, OnMessage, Automating Winamp, DllCall, ControlSend, MenuSelect
ja: PostMessage、メッセージリスト、メッセージチュートリアル、OnMessage、Winampの自動化、DllCall、ControlSend、MenuSelect

source: PostMessage: See SendMessage further below.
ja: PostMessage：後述のSendMessageを参照してください。

source: Priority: Changes the priority level of the current thread.
ja: Priority：現在のスレッドの優先度を変更する。

source: Process functions, Run, WinGetProcessName, WinGetProcessPath
ja: Process関数、Run、WinGetProcessName、WinGetProcessPath

source: ProcessExist, ProcessClose, ProcessWait and ProcessWaitClose no longer set ErrorLevel; instead, they return the PID.
ja: ProcessExist、ProcessClose、ProcessWait、ProcessWaitCloseは、ErrorLevelを設定しなくなり、代わりにPIDを返すようになりました。

source: ProcessWait, Run, WinWaitClose, Process functions, Win functions
ja: ProcessWait、Run、WinWaitClose、Process関数、Win関数

source: ProcessWaitClose, Run, WinWait, Process functions, Win functions
ja: ProcessWaitClose、Run、WinWait、Process関数、Win関数

source: Properties:
ja: プロパティ：

source: Property syntax and DefineProp can be used to define properties which compute a value each time they are evaluated, but each property must be defined in advance.
ja: Property構文と DefinePropは、評価されるたびに値を計算するプロパティを定義するために使用できますが、各プロパティは事前に定義する必要があります。

source: Prototype objects have this property by default.
ja: プロトタイプ・オブジェクトはデフォルトでこのプロパティを持っている。

source: Prototype: Retrieves or sets the object on which all instances of the class are based.
ja: Prototype：クラスのすべてのインスタンスの基となるオブジェクトを取得または設定します。

source: Ptr: Retrieves the buffer's current memory address.
ja: Ptr：バッファの現在のメモリアドレスを取得します。

source: Ptr: The address of the data contained by the object.
ja: Ptr：オブジェクトが含むデータのアドレス。

source: Push "appends" the values to the end of the Array MyArray.
ja: Pushは、Array MyArrayの末尾に値を「追加」する。

source: Push: Appends values to the end of an array.
ja: Push：配列の末尾に値を追加します。

source: QueryInterface is called for the Connector identified by Component, and if successful, the interface pointer is returned.
ja: QueryInterfaceは、Componentで識別されるコネクタに対して呼び出され、成功するとインタフェースポインタが返される。

source: Random has been reworked to utilize the operating system's random number generator, lift several restrictions, and make it more convenient to use.
ja: Randomは、オペレーティングシステムの乱数発生器を利用し、いくつかの制限を解除し、より便利に使用できるように改良されました。

source: RawRead: Reads raw binary data from the file into memory and advances the file pointer.
ja: RawRead：ファイルから生のバイナリデータをメモリに読み込んで、ファイルポインタを進める。

source: RawWrite: Writes raw binary data to the file and advances the file pointer.
ja: RawWrite：ファイルに生のバイナリデータを書き込み、ファイルポインタを進める。

source: Read: Reads a string of characters from the file and advances the file pointer.
ja: Read：ファイルから文字列を読み出し、ファイルポインタを進める。

source: ReadNumType: Reads a number from the file and advances the file pointer.
ja: ReadNumType：ファイルから数値を読み出し、ファイルポインタを進める。

source: ReadLine: Reads a line of text from the file and advances the file pointer.
ja: ReadLine：ファイルからテキストを1行読み出し、ファイルポインタを進める。

source: Redraw: Performance-related remarks about redraw behaviour of controls.
ja: Redraw：コントロールの再描画動作に関するパフォーマンスに関する注意事項。

source: Redraw: Redraws the region of the GUI window occupied by the control.
ja: Redraw：コントロールが占有するGUIウィンドウの領域を再描画します。

source: RegCreateKey, RegDelete, RegDeleteKey, RegRead, registry loop, SetRegView, IniWrite
ja: RegCreateKey、RegDelete、RegDeleteKey、RegRead、レジストリループ、SetRegView、IniWrite

source: RegCreateKey, RegDelete, RegDeleteKey, RegWrite, registry loop, SetRegView, IniRead
ja: RegCreateKey、RegDelete、RegDeleteKey、RegWrite、レジストリループ、SetRegView、IniRead

source: RegCreateKey, RegDelete, RegRead, RegWrite, registry loop, SetRegView, IniDelete
ja: RegCreateKey、RegDelete、RegRead、RegWrite、レジストリループ、SetRegView、IniDelete

source: RegCreateKey, RegDeleteKey, RegRead, RegWrite, registry loop, SetRegView, IniDelete
ja: RegCreateKey、RegDeleteKey、RegRead、RegWrite、レジストリループ、SetRegView、IniDelete

source: RegDelete, RegDeleteKey, RegRead, RegWrite, registry loop, SetRegView
ja: RegDelete、RegDeleteKey、RegRead、RegWrite、レジストリループ、SetRegView

source: RegExMatch can be used to search for a pattern (regular expression) within a string, making it much more flexible than InStr.
ja: RegExMatchは、文字列の中にあるパターン（正規表現）を検索することができるので、InStrよりはるかに柔軟性があります。

source: RegExMatch options O and P were removed; O (object) mode is now mandatory.
ja: RegExMatchのオプションOとPが削除され、O（オブジェクト）モードが必須となりました。

source: RegExMatch, Is functions
ja: RegExMatch、Is関数

source: RegExMatch, RegEx Quick Reference, Regular Expression Callouts, StrReplace, InStr
ja: RegExMatch、正規表現クイックリファレンス、正規表現の吹き出し、StrReplace、InStr

source: RegExReplace, RegEx Quick Reference, Regular Expression Callouts, InStr, SubStr, SetTitleMatchMode RegEx, Global matching and Grep (archived forum link)
ja: RegExReplace、正規表現クイックリファレンス、正規表現の吹き出し、InStr、SubStr、SetTitleMatchMode RegEx、Global matching and Grep (アーカイブ・フォーラムのリンク)

source: RegRead now has a Default parameter, like IniRead.
ja: RegReadに、IniRead のようなDefaultパラメータが追加されました。

source: RegWrite may be used to set the default for scripts launched from Explorer (e.g. by double-clicking a file):
ja: RegWriteは、エクスプローラーから起動したスクリプトのデフォルトを設定するために使用することができる（ファイルをダブルクリックするなど）：

source: Reload now does nothing if the script was read from stdin.
ja: スクリプトがstdinから読み込まれた場合、Reloadは何もしないようになりました。

source: Reload, How to edit a script, Editors with AutoHotkey support
ja: Reload、スクリプトの編集方法、AutoHotkeyサポートの編集者

source: RemoveAt: Removes items from an array.
ja: RemoveAt：配列から項目を削除します。

source: Rename: Renames a menu item.
ja: Rename：メニュー項目の名前を変更します。

source: Reset: Immediately resets the hotstring recognizer.
ja: Reset：ホットストリングレコグナイザーを即座にリセットします。

source: ResourceID: Assigns a non-standard resource ID to the main script.
ja: ResourceID：非標準のリソースIDをメインスクリプトに割り当てる。

source: Return returns from a function.
ja: Return 関数から戻り値を帰す。

source: Return, IsLabel, Else, Blocks, Break, Continue
ja: Return、IsLabel、Else、ブロック、Break、Continue

source: Round: Returns a number rounded to N decimal places.
ja: Round：小数点以下N桁で四捨五入した数値を返します。

source: Run and RunWait no longer recognize the UseErrorLevel option as ErrorLevel was removed.
ja: ErrorLevelが削除されたため、RunおよびRunWaitが UseErrorLevelオプションを認識しなくなりました。

source: Run tries both.
ja: Runは両方を試す。

source: Run, Process functions, Win functions
ja: Run、Process関数、Win関数

source: Run, WinClose, WinKill, Process functions, Win functions
ja: Run、WinClose、WinKill、Process関数、Win関数

source: Run, WinClose, WinKill, WinWait, WinWaitClose, WinExist, Win functions
ja: Run、WinClose、WinKill、WinWait、WinWaitClose、WinExist、Win関数

source: Run, WinExist, Process functions, Win functions
ja: Run、WinExist、Process関数、Win関数

source: RunAs, Process functions, Exit, CLSID List, DllCall
ja: RunAs、Process関数、Exit、CLSIDリスト、DllCall

source: Running with UI access prevents the +Parent option from working on an existing window if the new parent is always-on-top and the child window is not.
ja: UIアクセスで実行すると、新しい親が常にトップで子ウィンドウがそうでない場合、+Parentオプションが既存のウィンドウで機能しない。

source: SHFileOperation is used to do the actual work.
ja: 実際の作業にはSHFileOperationが使用されます。

source: SciTE4AutoHotkey is a free, SciTE-based AutoHotkey script editor.
ja: SciTE4AutoHotkey は無料の SciTEベースの AutoHotkey スクリプト エディタです。

source: Script File Codepage:
ja: スクリプトファイルのコードページ：

source: Script File Codepage: Using non-ASCII characters safely in scripts.
ja: スクリプトファイルのコードページ：スクリプトで非ASCII文字を安全に使用する。

source: Script Library Folders, Functions, FileInstall
ja: スクリプトライブラリフォルダ、関数、FileInstall

source: Script Startup (the Auto-execute Thread):
ja: スクリプトの起動（自動実行スレッド）：

source: Script Startup (the Auto-execute Thread): Taking action immediately upon starting the script, and changing default settings.
ja: スクリプトの起動（自動実行スレッド）：スクリプトを起動したら即座にアクションを起こし、デフォルト設定を変更する。

source: Scripting Language:
ja: スクリプト言語：

source: Scripting Language: Specific details about syntax (how to write scripts).
ja: スクリプト言語：構文に関する具体的な詳細（スクリプトの書き方）。

source: Scripting language:
ja: スクリプト言語

source: Scripting language: how to write scripts.
ja: スクリプト言語：スクリプトの書き方。

source: Seek: Moves the file pointer.
ja: Seek：ファイルポインタを移動します。

source: Send "Sincerely,{enter}John Smith" ; This line sends keystrokes to the active (foremost) window.
ja: Send "Sincerely,{enter}John Smith" ; この行は、アクティブ（最前面）ウィンドウにキーストロークを送信します。

source: Send (and its variants) now interpret {LButton} and {RButton} in a way consistent with hotkeys and Click.
ja: Send（およびその亜種）は、ホットキーおよびClickと一致する方法で{LButton}と {RButton}を解釈するようになりました。

source: SendInput() or WM_CHAR is used to send the character and the current Send mode has no effect.
ja: 文字の送信にはSendInput()またはWM_CHARが使用され、現在の送信モードは影響しない。

source: SendInput is affected by SendLevel, but the script's own hook hotkeys cannot be activated while a SendInput is in progress, since it temporarily deactivates the hook.
ja: SendInputは、SendLevelの影響を受けますが、SendInputの実行中はフックを一時的に無効化するため、スクリプト独自のフックホットキーを起動することはできません。

source: SendLevel, Hotkeys, Hotstrings
ja: SendLevel、ホットキー、ホットストリング
